Dzhplease/stm32f103-pwm-breathing-light/PMW.c
#include "stm32f10x.h"                  // Device header


void PWM_Init(void)
{
	RCC_APB1PeriphClockCmd (RCC_APB1Periph_TIM2,ENABLE);
	RCC_APB2PeriphClockCmd (RCC_APB2Periph_GPIOA ,ENABLE);
	
    GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode =GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin =GPIO_Pin_0 |GPIO_Pin_1 ;
	GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz ;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	
	TIM_InternalClockConfig(TIM2);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision =TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode =TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period =100-1;     //ARR
	TIM_TimeBaseInitStructure.TIM_Prescaler =720-1;   //PSC
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter =0;
	
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseInitStructure);
	
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode =TIM_OCMode_PWM1;    //CNT < CCR → 输出有效电平
	TIM_OCInitStructure.TIM_Pulse =50	;    //CCR
	TIM_OCInitStructure.TIM_OutputState =TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_OCPolarity =TIM_OCPolarity_Low ;
	
	TIM_OC1Init (TIM2,& TIM_OCInitStructure);

	
	TIM_OC2Init (TIM2,& TIM_OCInitStructure);
	
	TIM_Cmd(TIM2,ENABLE);
}	

void PWM_SetCompare1(uint16_t i)
{
	TIM_SetCompare1(TIM2,i);
}	

void PWM_SetCompare2(uint16_t i)
{
	TIM_SetCompare2(TIM2,i);
}

	
	
	
	